netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_getCustomizationId_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.netsuite">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
        <urn:method>getCustomizationId</urn:method>
        <urn:warningAsError/>
        <urn:disableMandatoryCustomFieldValidation/>
        <urn:disableSystemNotesForCustomFields/>
        <urn:ignoreReadOnlyFields/>
        <urn:partnerId/>
        <urn:applicationId/>
        <urn:email>%s(email)</urn:email>
        <urn:password>%s(password)</urn:password>
        <urn:account>%s(account)</urn:account>
        <urn:roleInternalId/>
        <urn:roleExternalId/>
        <urn:roleType/>
        <urn:roleName/>
        <urn:customizationIdReferece>
            <customizationType getCustomizationType="customRecordType"/>
            <includeInactives>321</includeInactives>
        </urn:customizationIdReferece>
    </soapenv:Body>
</soapenv:Envelope>